{
    "id": "935e418d-09f3-4de4-8ce3-c31f31580b12",
    "title": "Bucky Larson: Born to Be a Star",
    "description": "Living in small town Iowa, Bucky Larson is a simple minded, uneducated, beaver toothed young man still living with his protective parents, Jeremiah and Debbie Larson. Initially saddened when he is fired from his job as a bagger at a supermarket, he eventually sees it as a sign that he is destined for greatness in some other field. Based on some information he learns, Bucky believes that destiny is to become a porn star, despite he being a virgin and only having recently learned what masturbation is. With his parents' blessing, Bucky hops on a bus to Los Angeles to make it big there as a porn star. He is taken under the wings of a few people in LA. On the professional side, he meets the reigning king of porn, Dick Shadow, who only sees in Bucky a laughing stock. But washed up porn director Miles Deep stumbles across what he sees as an untapped niche market for Bucky's limited talents. Miles has the challenge of trying to convince investors who only see in Bucky the antithesis of porn. On the personal side, Bucky befriends a young diner waitress Kathy McGee, who helps Bucky find a place to live - albeit with an insensitive oaf named Gary who only wants to get into Kathy's pants - and navigate general life in the big city. Kathy, however, is facing her own demons in working toward her destiny, those demons which Bucky hopes he can help her beat down.",
    "imdb_rating": 3.2,
    "type": "movie",
    "created_at": "2021-06-16 20:14:09.224288+00:00",
    "updated_at": "2021-06-16 20:14:09.224304+00:00",
    "genres": [
        {
            "id": "5373d043-3f41-4ea8-9947-4b746c601bbd",
            "name": "Comedy"
        }
    ],
    "actors": [
        {
            "id": "6e0b0fb6-8edd-4161-807c-0556a2421522",
            "name": "Stephen Dorff"
        },
        {
            "id": "142dd99d-e64c-46cd-a1d0-996a1ea8341b",
            "name": "Nick Swardson"
        },
        {
            "id": "f92c9c08-4674-4aba-85be-eb8b28364fad",
            "name": "Christina Ricci"
        },
        {
            "id": "9ebe3458-ff62-4316-be93-18777e1ba782",
            "name": "Don Johnson"
        }
    ],
    "writers": [
        {
            "id": "490698ef-aa5e-4554-95a0-f19ad3bb451e",
            "name": "Allen Covert"
        },
        {
            "id": "94b38a86-0a2a-415a-a384-cc01d1984b68",
            "name": "Adam Sandler"
        }
    ],
    "directors": [
        {
            "id": "22c22735-fd77-4a69-97e0-5307adcc096c",
            "name": "Tom Brady"
        }
    ]
}